

keys2 = "Safar duosi"
asos2 ="""Сафар дуоси

«Аллохумма илайка таважжахту ва бика иъмасомму. Аллохумма акфини ма аҳам мани ва ма ла ахтамму лаху. Аллохумма заввидним-таква, вагфирли занби ва важ жиҳни лил-хойри айна ма таважжахму».

Маъноси: «Ё Аллох, Сен томон интилдим. Сенга юкиндим. Ё Аллох, мени андишалан тирган ёхуд андишалантирмаган хусусларда Сен менга кифоя кил. Таквони менга озуқа кил, Ё Аллох! Гуноҳимни кечир ва каерга бормайин, мени доимо яхшиликка бошла, ё
Раббий». (Пайғамбаримиз (соллаллоху алай ҳи ва саллам), ҳар гал йўлга чикканда бу дуо ни ўқир эдилар.)"""


keys3 = "Iymon zaiflashsa"
asos3 = """('Иймон келтирганлар ва Аллоҳнинг зикри ила қалблари ором топганлар. Аё, '
 'Аллоҳнинг зикри ила қалблар ором топмасми? (Ҳа, иймон келтирганларнинг '      
 'қалблари Аллоҳнинг зикри ила ором топади. Чунки у қалблар ўзларининг Аллоҳга '
 'доимий боғлиқ эканларини ҳис этадилар. Чунки бу қалблар дунёдаги ҳамма нарса '
 'Аллоҳдан эканлигини яхши биладилар.)')"""


keys4 = "baxtsiz bolsangiz"
asos4 = """Бўшашманглар! Хафа бўлманглар! Сизлар, агар мўмин бўлсаларингиз, '
 'устунсизлар. (Эй мусулмонлар! Ҳеч бўшашманглар, заифлашманглар, сизга етган '
 'мусибатларга, бошингизга тушган оғирликларга хафа бўлманглар. Сизлар дунёда '
 'ҳаммани ҳидоятга даъват қилувчиларсиз. Улар зулматга, залолатга '
 'чақирувчилардир. Сизлар икки дунё саодатига эгасиз. Улар икки дунё '
 'бадбахтлигига эгадирлар.)"""


keys5 = "Tashvishda bo'lsangiz"
asos5 = """Сабр ва намоз ила ёрдам сўранг. Ва, албатта, у нафси синиқлардан бошқаларга '
 'жуда катта ишдир. (Биз ёрдам сўранг деб таржима қилган ибора араб тилида '    
 '"истаъийну" деб келган. Бу сўзнинг маъноси бир ишга уриниб туриб, яна '       
 'қўшимча ёрдам сўрашни англатади. Демак, мусулмон киши ҳар бир ишга астойдил ' 
 'уринади ва шу уриниш билан бирга, Аллоҳдан ёрдам сўрайди. Сабр ҳам, кўпчилик '
 'хаёл қилганидай салбий маънода, яъни, нима бўлса ҳам сабр қиляпман, деб '     
 'жим-ҳаракатсиз туриш эмас, балки Аллоҳнинг айтганини бажариш жараёнида дуч '  
 'келадиган машаққатларни енгишдаги сабрдир. Энг бош сабр ҳавою нафсни, '
 'роҳат-фароғатни, мансабни тарк қилиб, Аллоҳнинг айтганига юришга чидамдир.)"""


keys6 = "Gunox qilgan bolsangiz"
asos6 = """Сен менинг тарафимдан: «Эй ўз жонларига исроф (жабр) қилган бандаларим, '
 'Аллоҳнинг раҳматидан ноумид бўлманг! Албатта, Аллоҳ барча гуноҳларни '
 'мағфират этар. Албатта, унинг ўзи ўта мағфиратли ва ўта раҳмли зотдир», деб '
 'айт. (Имом «Бухорий Саъд ибн Жубайрдан (р. а.) келтирган ривоятда '
 'айтилишича, кўплаб гуноҳлар қилган бир гуруҳ мушрик Расулуллоҳнинг (с. а. '
 'в.) ҳузурларига келиб: «Албатта, сен даъват қилаётган нарса жуда ҳам гўзал. '
 'Қани, айт-чи, биз қилган нарсаларни ювадиган нарса ҳам борми?» деб '
 'сўрашганида Аллоҳ таоло ушбу ояти каримани туширган экан.)
 
 
 
 Сен: «Агар Аллоҳга муҳаббат қилсангиз, бас, менга эргашинг. Аллоҳ сизга '
 'муҳаббат қилади ва сизларни гуноҳларингизни мағфират қилади», деб айт."""


keys7 = "jahldor_bolsangiz"
asos7 = """Куфр келтирганларнинг сени ушлаш, ўлдириш ёки чиқариб юбориш учун макр '
 'қилганларини эсла. Улар макр қилдилар ва Аллоҳ ҳам «макр» қилди. Аллоҳ '
 '«макр» қилгувчиларнинг устасидир. (Уламоларимиз Аллоҳга «маккор» сифатини '
 'беришдан қайтарганлар. Шунинг учун ҳам Қуръон ёки ҳадисда Аллоҳ таолога '
 'нисбатан «макр» лафзи ишлатилса, уни бандаларга нисбатан қўлланилгани каби '
 'тушунмаслик керак.)"""


dok = """
Рўза тутиш (саҳарлик, оғиз ёпиш) дуоси:

Навайту ан асувма совма шаҳри рамазона минал фажри илал мағриби, холисан лиллаҳи таъаалаа Аллоҳу акбар.
Маъноси: Рамазон ойининг рўзасини субҳдан то кун ботгунча тутмоқни ният қилдим. Холис Аллоҳ учун Аллоҳ буюкдир.

Ифторлик (оғиз очиш) дуоси:

Аллоҳумма лака сумту ва бика ааманту ва аълайка таваккалту ва аълаа ризқика афтарту, фағфирлий ма қоддамту ва маа аххорту бироҳматика йаа арҳамар рооҳимийн.
Маъноси: Эй Аллоҳ, ушбу Рўзамни Сен учун тутдим ва Сенга иймон келтирдим ва Сенга таваккал қилдим ва берган ризқинг билан ифтор қилдим. Эй меҳрибонларнинг энг меҳрибони, менинг аввалги ва кейинги гуноҳларимни мағфират қилгил."""




suralar1 = """ФОТИҲА СУРАСИ

Аъузу биллаҳи минаш шайтонир рожийм. Бисмиллаҳир рохманир роҳийм
Алҳамду лиллаҳи роббил Баламийн. Ар-роҳманир роҳийм. Малики явмиддийн. Ийяка наъбуду ва ийяка настаъийн. Ихдинас сиротол мустакийм. Сиротоллазийна ан ъамма ъалайхим. Foupuл магзуби ьалайхим валаз-золлийн. (Фотиҳа сурасидан кейин овоз чикарилмасдан "Амийн" дейилиши керак"""

suralar2 = """КУНУТ ДУОСИ

Аллохумма инна настаъинука ва настаг фирук. Вануъмину бика ва натаваккалу ъа лайка ва нусний ъалайкал хойр. Нашкуру ка ва лаа накфурук. Ва нахлаъу ва натруку май-яфжурук. Аллохумма иййака наъбуду ва лака нусоллий ва насжуду ва илайка на съа ва наҳфиду наржу роҳматак(а). Ва нах ша базабака инна базабака бил куффари мулҳиқ."""


suralar3 = """КАВСАР СУРАСИ

Инна аъмойнакал-кавсар. Фасолли лироб бика ванҳар. Инна шаани ака ҳувал абтар."""


suralar4 = """ДУО

Роббана атина фид дуня ҳасанатав ва фил ахироти ҳасанатав ва қина ъазабан нар."""

suralar5 = """АЗОН ДУОСИ

Аллохумма робба ҳазиҳид даъватит там мах. Вас-солатил коимаҳ, ати Муҳаммада нил васийлата вал фазийлах. Вад-дарожа мал ъалиятар рофиъа. Вабъас-ху макомам маҳмуданиллазий ваъадтах. Варзукна ша фа-ъатаху явмал киямах. Иннака ла тух лифул миъад!"""



manba = """Пайғамбаримиз (соллаллоҳу алайҳи ва саллам)нинг рўза ва рўзадорлар ҳақида кўплаб гўзал башорат-хушхабарлар берганлар. Жумладан, Пайғамбаримиз (соллаллоҳу алайҳи ва саллам): “Рўза тутган кишининг уйқуси ибодат, сукут сақлашлиги Аллоҳга тасбеҳ, қилган амалининг савоби орттириб берилади ва гуноҳи кечирилгандир”,  деб марҳамат қилдилар.

Рамазон бу шундай муборак ойки, бу ойда рўза тутиш ибодат, рўза ҳолатда ухлаш ибодат, ҳатто гапирмасдан жим туриш ҳам ибодат, ифторликда таом тановул қилса ҳам ибодатдир. Зотан, Расулуллоҳ (соллаллоҳу алайҳи ва саллам): “Бу Рамазон ойи барака ойидир”,  деб бежизга айтмадилар.

Пайғамбаримиз (соллаллоҳу алайҳи ва саллам) “Рўзадорнинг уйқуси ҳам ибодатдир” дедилар, яъни рўзадор одам оиласининг нафақаси учун ишлаб меҳнат қилса ва чарчаганидан пешиндан кейин ёки асрдан сўнг бироз мизғиб олса, уни Аллоҳ таоло ҳар бир чиқарган нафаси учун зикр қилди, деб номаи аъмолига ёзиб қўяди. Рўзадорнинг мартабасига қаранг. Аллоҳ таоло рўзадор бандасини қандай азиз қилиб қўйди!"""








